tap "azure/kubelogin"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "universal-ctags/universal-ctags"
# Blocking, shuffling and loss-less compression library
brew "c-blosc"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# C Foreign Function Interface for Python
brew "cffi"
# Cross-platform make
brew "cmake"
# Generic machine emulator and virtualizer
brew "qemu"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Modern diagram scripting language that turns text to diagrams
brew "d2"
# Isolated development environments using Docker
brew "docker-compose"
# .NET Core
brew "dotnet"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Platform built on V8 to build network applications
brew "node"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Transparent bidirectional bridge between Git and Mercurial
brew "git-remote-hg"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Manage compile and link flags for libraries
brew "pkg-config"
# File format designed to store large amounts of data
brew "hdf5"
# Command-line hex viewer
brew "hexyl"
# Uses CSS selectors to extract bits content from HTML files
brew "htmlq"
# Improved top (interactive process viewer)
brew "htop"
# Serializes the output of command-line tools to structured JSON output
brew "jc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Run local Kubernetes cluster in Docker
brew "kind"
# C library implementing the SSH2 protocol
brew "libssh2"
# Library to render SVG files using Cairo
brew "librsvg"
# C virtualization API
brew "libvirt", restart_service: true
# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"
# Powerful, lightweight programming language (v5.1.5)
brew "lua@5.1"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: true
# GUI for vim, made for macOS
brew "macvim"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Run a Kubernetes cluster locally
brew "minikube"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# No Nonsense Neovim Client in Rust
brew "neovide"
# Cross-platform application and UI framework
brew "qt@5"
# Neovim GUI, in Qt
brew "neovim-qt"
# Use Objective-C files for shell script-like tasks
brew "objc-run"
# High-level interpreted language for numerical computing
brew "octave"
# Development kit for the Java programming language
brew "openjdk@11"
# Development kit for the Java programming language
brew "openjdk@17", link: true
# Open source suite of directory software
brew "openldap"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Tool for managing OCI containers and pods
brew "podman"
# Object-relational database system
brew "postgresql@13"
# Object-relational database system
brew "postgresql@14"
# Show ps output as a tree
brew "pstree"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Python interface to gdbm
brew "python-gdbm@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Python interface to Tcl/Tk
brew "python-tk@3.10"
# Python interface to Tcl/Tk
brew "python-tk@3.11"
# Python interface to Tcl/Tk
brew "python-tk@3.12"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Tool to convert RPM package to CPIO archive
brew "rpm2cpio"
# Safe, concurrent, practical language
brew "rust"
# Build tool for Scala projects
brew "sbt"
# JVM-based programming language
brew "scala"
# Simple keystroke visualizer
brew "showkey"
# Non-interactive SSH password auth
brew "sshpass"
# High-performance system programming language
brew "swift"
# System performance benchmark tool
brew "sysbench"
# macOS and Linux VMs on Apple Silicon to use in CI and other automations
brew "tart"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Maintained ctags implementation
brew "universal-ctags", args: ["HEAD"]
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# A Kubernetes credential (exec) plugin implementing azure authentication
brew "azure/kubelogin/kubelogin"
cask "font-hack-nerd-font"
cask "font-source-code-pro"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Keyboard customiser
cask "karabiner-elements"
# Command-line shell and scripting language
cask "powershell"
# Virtual machines UI using QEMU
cask "utm"
# Development environment
cask "vagrant"
# Network protocol analyzer
cask "wireshark"
